app/controllers/cats_controller.rb

    def create
        cat = Cat.create(cat_params)
---
INSERT INTO "cats" ("name", "age", "enjoys", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "chatty"], ["age", 10], ["enjoys", "whale watching"], ["created_at", "2019-06-06 18:35:00.941653"], ["updated_at", "2019-06-06 18:35:00.941653"]]